In [3]:
!pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.9-cp311-cp311-win_amd64.whl.metadata (4.5 kB)
Downloading psycopg2-2.9.9-cp311-cp311-win_amd64.whl (1.2 MB)
   ---------------------------------------- 0.0/1.2 MB ? eta -:--:--
   ---------------------------------------- 1.2/1.2 MB 19.2 MB/s eta 0:00:00
Installing collected packages: psycopg2
Successfully installed psycopg2-2.9.9

In [26]:
import psycopg2
import pandas as pd
import numpy as np
# try:
#     conn = psycopg2.connect(host="localhost", database="postgres", user="postgres", password="Komal@06")
# except psycopg2.Error as e:
#     print("Error: could not make a connection to the postgres database")
#     print(e)

In [22]:
try:
    conn = psycopg2.connect(host="localhost", database="my_first_db", user="postgres", password="Komal@06")
except psycopg2.Error as e:
    print("Error: could not make a connection to the postgres database")
    print(e)
    
cur = conn.cursor()
conn.set_session(autocommit=True)

In [4]:
cur.execute("CREATE TABLE IF NOT EXISTS students \
            (student_id int,\
            name varchar, \
            age int, \
            gender varchar, \
            subject varchar, \
            marks int);")

In [15]:
# cur.execute("INSERT INTO students (student_id, name, age, gender, subject, marks) \
#              VALUES (%s, %s, %s, %s, %s, %s)", \
#              (1, "Raj", 23, "Male", "Python", 85))

cur.execute("INSERT INTO students (student_id, name, age, gender, subject, marks) \
             VALUES (%s, %s, %s, %s, %s, %s)", \
             (2, "Priya", 22, "Female", "Python", 86))

In [10]:
cur.execute("DELETE FROM students WHERE student_id = 2")

In [23]:
cur.execute("SELECT * FROM students;")
rows = cur.fetchall()

for row in rows:
    print(row)

(1, 'Raj', 23, 'Male', 'Python', 85)
(2, 'Priya', 22, 'Female', 'Python', 86)

In [24]:
cur.close()
conn.close()

In [136]:
def connection_db():    
    try:
        conn = psycopg2.connect(host="localhost", database="accounts", user="postgres", password="Komal@06")
        print("Connection established successfully")
    except psycopg2.Error as e:
        print("Error: could not make a connection to the postgres database")
        print(e)
    
    cur = conn.cursor()
    conn.set_session(autocommit=True)
    
    return conn, cur

In [27]:
accounts_data = pd.read_csv('Wealth-AccountData.csv')
accounts_country = pd.read_csv('Wealth-AccountsCountry.csv')
accounts_series = pd.read_csv('Wealth-AccountSeries.csv')

In [32]:
accounts_country = accounts_country[['Code', 'Long Name', 'Short Name', 'Table Name', 'Currency Unit']]

In [33]:
accounts_country.head()

  Code                  Long Name Short Name Table Name      Currency Unit
0  ALB        Republic of Albania    Albania    Albania       Albanian lek
1  ARG         Argentine Republic  Argentina  Argentina     Argentine peso
2  ARM        Republic of Armenia    Armenia    Armenia      Armenian dram
3  AUS  Commonwealth of Australia  Australia  Australia  Australian dollar
4  AUT        Republic of Austria    Austria    Austria               Euro

In [41]:
accounts_data.rename(columns={
    '1995 [YR1995]': 1995,
    '2000 [YR2000]': 2000,
    '2005 [YR2005]': 2005,
    '2010 [YR2010]': 2010,
    '2015 [YR2015]': 2015,
    '2018 [YR2018]': 2018
}, inplace=True)

In [43]:
accounts_data = accounts_data[['Country Name', 'Country Code', 
                              'Series Code', 1995, 2000, 2005,
                              2010, 2015, 2018]]

In [44]:
accounts_data.head()

,Country Name,Country Code,Series Code,1995,2000,2005,2010,2015,2018
0,Albania,ALB,NW.HCA.TO,4.49E+10,4.36E+10,5.440000e+10,6.810000e+10,7.370000e+10,8.12E+10
1,Albania,ALB,NW.HCA.PC,14072.79,14118.13,1.807230e+04,2.336286e+04,2.559371e+04,28333.68
2,Albania,ALB,NW.HCA.FEMP.PC,3468.858,3424.007,2.222115e+03,2.889150e+03,2.987545e+03,3312.927
3,Albania,ALB,NW.HCA.MEMP.PC,6507.931,6872.019,1.168935e+04,1.578992e+04,1.730701e+04,19245.19
4,Albania,ALB,NW.HCA.FEMA.PC,4893.006,4695.071,2.886736e+03,3.613606e+03,3.767628e+03,4161.137

In [48]:
accounts_series.columns

Index(['Code', 'Indicator Name', 'Long definition', 'Source', 'Topic',
       'Unit of measure', 'Periodicity', 'Reference period',
       'Statistical concept and methodology', 'Previous Indicator Code',
       'Previous Indicator Name'],
      dtype='object')

In [50]:
accounts_series = accounts_series[['Code', 'Indicator Name',
                                  'Topic', 'Long definition']]

In [51]:
accounts_series.head()

,Code,Indicator Name,Topic,Long definition
0,NW.HCA.TO,Human capital (constant 2018 US$),Human capital,Human capital is computed as the present value...
1,NW.HCA.PC,Human capital per capita (constant 2018 US$),Human capital,Human capital is computed as the present value...
2,NW.HCA.FEMP.PC,"Human capital per capita, employed female (con...",Human capital,Human capital is computed as the present value...
3,NW.HCA.MEMP.PC,"Human capital per capita, employed male (const...",Human capital,Human capital is computed as the present value...
4,NW.HCA.FEMA.PC,"Human capital per capita, female (constant 201...",Human capital,Human capital is computed as the present value...

In [137]:
conn, cur = connection_db()

Connection established successfully

In [94]:
create_table_accountscountry = (""" CREATE TABLE IF NOT EXISTS accounts_country( 
country_code VARCHAR PRIMARY KEY,
Long_Name VARCHAR,
Short_Name VARCHAR,
Table_Name VARCHAR,
Currency_Unit VARCHAR)""")

cur.execute(create_table_accountscountry)
conn.commit()

In [95]:
create_table_accountsseries = (""" CREATE TABLE IF NOT EXISTS accounts_series(
code VARCHAR,
Indicator_Name VARCHAR,
Topic VARCHAR,
Long_Definition VARCHAR)""")

cur.execute(create_table_accountsseries)
conn.commit()

In [96]:
create_table_accountsdata = (""" CREATE TABLE IF NOT EXISTS accounts_data(
Country_Name VARCHAR,
Country_Code VARCHAR,
Series_Code VARCHAR,
"1995" int,
"2000" int,
"2005" int,
"2010" int,
"2015" int,
"2018" int)""")

cur.execute(create_table_accountsdata)
conn.commit()

In [78]:
accounts_country.head().to_numpy()

array([['ALB', 'Republic of Albania', 'Albania', 'Albania',
        'Albanian lek'],
       ['ARG', 'Argentine Republic', 'Argentina', 'Argentina',
        'Argentine peso'],
       ['ARM', 'Republic of Armenia', 'Armenia', 'Armenia',
        'Armenian dram'],
       ['AUS', 'Commonwealth of Australia', 'Australia', 'Australia',
        'Australian dollar'],
       ['AUT', 'Republic of Austria', 'Austria', 'Austria', 'Euro']],
      dtype=object)

In [81]:
for x in accounts_country.head().to_numpy():
    print(x)

['ALB' 'Republic of Albania' 'Albania' 'Albania' 'Albanian lek']
['ARG' 'Argentine Republic' 'Argentina' 'Argentina' 'Argentine peso']
['ARM' 'Republic of Armenia' 'Armenia' 'Armenia' 'Armenian dram']
['AUS' 'Commonwealth of Australia' 'Australia' 'Australia'
 'Australian dollar']
['AUT' 'Republic of Austria' 'Austria' 'Austria' 'Euro']

In [ ]:
# Convert DataFrame rows to a list of tuples
country_data = [tuple(x) for x in accounts_country.to_numpy()]

# Correct SQL insert statement with proper column names
accounts_country_table_insert = ("""
INSERT INTO accounts_country (
"country_code",
"long_name",
"short_name",
"table_name",
"currency_unit"
)
VALUES (%s, %s, %s, %s, %s)
""")

# Iterate through data and execute the insert command
for i in country_data:
    cur.execute(accounts_country_table_insert, i)


# Commit the transaction to save changes
conn.commit()

In [144]:
# Convert DataFrame rows to a list of tuples
series_data = [tuple(x) for x in accounts_series.to_numpy()]

# Correct SQL insert statement with proper column names
accounts_series_table_insert = ("""
INSERT INTO accounts_series (
"code",
"indicator_name",
"topic",
"long_definition"
)
VALUES (%s, %s, %s, %s)
""")

# Iterate through data and execute the insert command
for i in series_data:
    cur.execute(accounts_series_table_insert, i)  # Fixed the variable name

# Commit the transaction to save changes
conn.commit()

In [154]:
cols_to_convert = [1995, 2000, 2005, 2010, 2015, 2018]

# Replace invalid entries with NaN and then convert to float
for col in cols_to_convert:
    accounts_data[col] = pd.to_numeric(accounts_data[col], errors='coerce').fillna(0)

In [155]:
accounts_data = accounts_data.astype({1995:'int', 2000:'int', 2005:"int", 2010:"int", 2015:"int", 2018:"int"})

In [157]:
# Convert DataFrame rows to a list of tuples
series_data = [tuple(x) for x in accounts_data.to_numpy()]

# Correct SQL insert statement with proper column names
accounts_data_table_insert = ("""
INSERT INTO accounts_data (
"country_name",
"country_code",
"series_code",
"1995",
"2000",
"2005",
"2010",
"2015",
"2018"
)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
""")

# Iterate through data and execute the insert command
for i in series_data:
    cur.execute(accounts_data_table_insert, i)  # Fixed the variable name

# Commit the transaction to save changes
conn.commit()

In [158]:
conn.close()
cur.close()